
public class RunPT {
/* Програма симулуює створення Автобусів та Трамваїв на основі абстрактного класу ГромадськийТранспорт,
 * Класи мають перезагружені методи Абстрактного класу так як Їхати та Вийти з ладу*/
	public static void main(String[] args) throws InterruptedException {
		PublicTransport [] B42 = {new Bus(42,30,"Сихів-Центр", 3.5,"Не рейковий ТЗ"),
		 new Tram(1, 80, "Зал.Вокзал-Центр", 2.4, "рейковий ТЗ"),
		 new Bus(15,32,"Сахарова-Дорошенка", 1.7,"Не рейковий ТЗ"),
		 new Bus(54,30,"Пасічна-Вашингтона", 1.0,"Не рейковий ТЗ"),
		 new Tram(3, 95, "Кн.Ольги-прос.Свободи", 4.2, "рейковий ТЗ"),
		 new Tram(10, 102, "Зал.Вокзал-Пасічна", 3.9, "рейковий ТЗ"),
		 new Tram(8, 95, "Сихів-прос.Свободи", 2.0, "рейковий ТЗ")};
		for(PublicTransport Num: B42){
			Num.Move();
		}
		Thread.sleep(5000); 
		System.out.println("В МІСТІ ВИМКНУЛИ СВІТЛО, В ЗВ'ЗКУ З ПОЛОМКОЮ НА ТЕС!!!");
		for(PublicTransport Out: B42){
			Out.PowerOut();
			Thread.sleep(1000);
		}
		System.out.println("Автобуси продовжили рух");
		}
	}
